myinit.org
* Speed up emacs
#+BEGIN_SRC emacs-lisp
;;;; SPEED UP EMACS ====================================
;; Decrease the number of garbage collection invocations
(setq gc-cons-threshold 10000000)
(add-hook 'emacs-startup-hook 'my/set-gc-threshold)
(defun my/set-gc-threshold ()
  "Reset `gc-cons-threshold' to its default value."
  (setq gc-cons-threshold 800000))
;;;; ==================================================

#+END_SRC

* sr-speedbar
#+BEGIN_SRC emacs-lisp
(use-package sr-speedbar
  :ensure t
  :defer t
  :init
  ;; Show tree on the left side
  (setq sr-speedbar-right-side nil)
  (setq sr-speedbar-auto-refresh t)
  ;;(setq speedbar-show-unknown-files t)
  ;; Show all files
  ;; Bigger size (default is 24)
  (setq sr-speedbar-max-width 20)
  (setq sr-speedbar-width 20)
  ;;(setq speedbar-use-images t)
  (sr-speedbar-open)
  :config
  (with-current-buffer sr-speedbar-buffer-name
    (setq window-size-fixed 'width))  
  :bind ("<f9>" . sr-speedbar-toggle)
  )
#+END_SRC
	  
* Smooth scrolling
#+BEGIN_SRC emacs-lisp
(use-package smooth-scrolling
  :ensure t
  :config
  (progn
    (setq-default smooth-scroll-margin 2)
    (smooth-scrolling-mode)))

(setq mouse-wheel-progressive-speed nil
      mouse-wheel-scroll-amount '(3 ((shift) . 5))
      scroll-conservatively 101)
#+END_SRC
	  
* Toggle comment using C-M-/
#+BEGIN_SRC emacs-lisp
;; Toggle comment using C-M-/
(defun xah-comment-dwim ()
  "Like `comment-dwim', but toggle comment if cursor is not at end of line."
  (interactive)
  (if (region-active-p)
      (comment-dwim nil)
    (let ((-lbp (line-beginning-position))
          (-lep (line-end-position)))
      (if (eq -lbp -lep)
          (progn
            (comment-dwim nil))
        (if (eq (point) -lep)
            (progn
              (comment-dwim nil))
          (progn
            (comment-or-uncomment-region -lbp -lep)
            (forward-line )))))))
(global-set-key (kbd "C-M-/") 'xah-comment-dwim)
#+END_SRC
* Interface tweaks
#+BEGIN_SRC emacs-lisp
(setq inhibit-startup-message t)
(tool-bar-mode -1)
(cua-mode t)
(setq-default cursor-type 'bar) 

;;(speedbar 1)
;; sr-speedbar instead
(global-visual-line-mode 1)
(global-set-key (kbd "<f5>") 'revert-buffer)

(tooltip-mode 0)
(setq tooltip-use-echo-area t)
;; Display paren (highlight matching brackets)
(show-paren-mode 1)
(setq show-paren-delay 0)
;; Display line number when programming
(add-hook 'prog-mode-hook 'linum-mode)
(fset 'yes-or-no-p 'y-or-n-p)
(setq user-full-name "Do Hong Son"
			user-mail-address "sonstephendo@gmail.com")
(set-face-attribute 'default nil
                    :family "Source Code Pro"
                    :height 128
                    :weight 'normal
                    :width 'normal)
#+END_SRC
* Undo Tree
#+BEGIN_SRC emacs-lisp
    (use-package undo-tree
    :ensure t
    :init
    (global-undo-tree-mode))

(defalias 'redo 'undo-tree-redo)
(global-set-key (kbd "C-z") 'undo) ;; (Ctrl+z)
(global-set-key (kbd "C-y") 'redo) ;; (Ctrl+y); 
  #+END_SRC
* Flycheck
#+BEGIN_SRC emacs-lisp
(use-package flycheck
  :ensure t
  :commands flycheck-mode
  :init
  (add-hook 'c++-mode-hook 'flycheck-mode)
  (add-hook 'c-mode-hook 'flycheck-mode))

(use-package flycheck-irony
  :ensure t
  :commands flycheck-irony-setup
  :init
  (add-hook 'c++-mode-hook 'flycheck-irony-setup)
  (add-hook 'c-mode-hook 'flycheck-irony-setup))

#+END_SRC
* Yasnippet
#+BEGIN_SRC emacs-lisp
(use-package yasnippet
	:ensure t
	:init
	(yas-global-mode 1))
#+END_SRC


* electric-pair-mode
#+BEGIN_SRC emacs-lisp
;; auto close bracket insertion. New in emacs 24
(electric-pair-mode 1)
#+END_SRC
* 'try' package
#+BEGIN_SRC emacs-lisp
(use-package try
:ensure t)
#+END_SRC
* Org mode
#+BEGIN_SRC emacs-lisp
(use-package org
  :ensure org-plus-contrib
)

(use-package org-bullets
  :ensure t
  :config
  (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))
#+END_SRC

* Themes and modeline
#+BEGIN_SRC emacs-lisp
(use-package color-theme
      :ensure t)
(use-package moe-theme
:ensure t
:config (load-theme 'moe-dark t)
)

(use-package powerline
:ensure t
:config
(powerline-moe-theme)
)
#+END_SRC
* IBuffer
#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-x C-b") 'ibuffer)
  (setq ibuffer-saved-filter-groups
	(quote (("default"
		 ("dired" (mode . dired-mode))
		 ("org" (name . "^.*org$"))
	       
		 ("web" (or (mode . web-mode) (mode . js2-mode)))
		 ("shell" (or (mode . eshell-mode) (mode . shell-mode)))
		 ("mu4e" (or

                 (mode . mu4e-compose-mode)
                 (name . "\*mu4e\*")
                 ))
		 ("programming" (or
				 (mode . python-mode)
				 (mode . c-mode)
				 (mode . c++-mode)))
		 ("emacs" (or
			   (name . "^\\*scratch\\*$")
			   (name . "^\\*Messages\\*$")))
		 ))))
  (add-hook 'ibuffer-mode-hook
	    (lambda ()
	      (ibuffer-auto-mode 1)
	      (ibuffer-switch-to-saved-filter-groups "default")))

  ;; don't show these
					  ;;(add-to-list 'ibuffer-never-show-predicates "zowie")
  ;; Don't show filter groups if there are no buffers in that group
  (setq ibuffer-show-empty-filter-groups nil)

  ;; Don't ask for confirmation to delete marked buffers
  (setq ibuffer-expert t)
#+END_SRC
* Tabbar show file
#+BEGIN_SRC emacs-lisp
(use-package tabbar
  :ensure t
  :config (tabbar-mode 1)
  )
#+END_SRC

* Misc packages
  #+BEGIN_SRC emacs-lisp


  ;; Highlights the current cursor line
  (global-hl-line-mode t)
  
  ;; deletes all the whitespace when you hit backspace or delete
  (use-package hungry-delete
  :ensure t
  :config
  (global-hungry-delete-mode))
  
  ;; expand the marked region in semantic increments (negative prefix to reduce region)
  (use-package expand-region
  :ensure t
  :config 
  (global-set-key (kbd "C-=") 'er/expand-region))

(setq save-interprogram-paste-before-kill t)
  
  #+END_SRC
* Swiper / Ivy / Counsel
Swiper gives us a really efficient incremental search with regular expressions
  and Ivy / Counsel replace a lot of ido or helms completion functionality
#+BEGIN_SRC emacs-lisp
(use-package counsel
  :ensure t
  :bind
  (("M-y" . counsel-yank-pop)
   :map ivy-minibuffer-map
   ("M-y" . ivy-next-line))
  )

 (use-package ivy
  :ensure t
  :diminish (ivy-mode)
  :bind (("C-x b" . ivy-switch-buffer))
  :config
  (ivy-mode 1)
  (setq ivy-use-virtual-buffers t)
  (setq ivy-display-style 'fancy))

(use-package swiper
  :ensure t
  :bind (("C-s" . swiper)
	 ("C-r" . ivy-resume)
	 ("M-x" . counsel-M-x)
	 ("C-x C-f" . counsel-find-file))
  :config
  (progn
    (ivy-mode 1)
    (setq ivy-use-virtual-buffers t)
	(setq ivy-display-style 'fancy)
   ;; space for paste
    (define-key read-expression-map (kbd "C-r") 'counsel-expression-history)
    ))
#+END_SRC
("C-r" . swiper)

* Multiple-cursors
#+BEGIN_SRC emacs-lisp
;; Multiple Cursors
(use-package multiple-cursors
  :ensure t
)
(global-set-key (kbd "C-+") 'mc/edit-lines)
(global-set-key (kbd "C->")  'mc/mark-next-like-this)
(global-set-key (kbd "C-<")  'mc/mark-previous-like-this)
(global-set-key (kbd "C-|")  'mc/mark-all-like-this)
(global-set-key (kbd "C-S-<down-mouse-1>")  'mc/add-cursor-on-click)

#+END_SRC

* which key
Brings up some help
#+BEGIN_SRC emacs-lisp
(use-package which-key
	:ensure t 
	:config
	(which-key-mode))
#+END_SRC
* Irony compilation
#+BEGIN_SRC emacs-lisp
;; == irony-mode ==
(use-package irony
  :ensure t
  :defer t
  :init
  (add-hook 'c++-mode-hook 'irony-mode)
  (add-hook 'c-mode-hook 'irony-mode)
  (add-hook 'objc-mode-hook 'irony-mode)
  :config
  ;; replace the `completion-at-point' and `complete-symbol' bindings in
  ;; irony-mode's buffers by irony-mode's function
  (defun my-irony-mode-hook ()
    (define-key irony-mode-map [remap completion-at-point]
      'irony-completion-at-point-async)
    (define-key irony-mode-map [remap complete-symbol]
      'irony-completion-at-point-async))
  (add-hook 'irony-mode-hook 'my-irony-mode-hook)
  (add-hook 'irony-mode-hook 'irony-cdb-autosetup-compile-options)
  )
#+END_SRC

* Company-mode
#+BEGIN_SRC emacs-lisp
;; == company-mode ==
(use-package company
  :ensure t
  :defer t
  :init (add-hook 'after-init-hook 'global-company-mode)
  :bind ("<backtab>" . company-complete)
  :config
  (use-package company-irony :ensure t :defer t)
  (setq company-idle-delay              0.1
	company-minimum-prefix-length   2
	company-show-numbers            t
	company-tooltip-limit           20
	company-dabbrev-downcase        nil
	company-backends                '((company-irony company-gtags))
	)
  :bind ("C-SPC " . company-complete-common)
  )

(use-package company-c-headers
  :ensure t
  :config
  (add-to-list 'company-backends 'company-c-headers))
#+END_SRC
* Set some key...
#+BEGIN_SRC emacs-lisp
;; unset C- and M- digit keys
(dotimes (n 10)
  (global-unset-key (kbd (format "C-%d" n)))
  (global-unset-key (kbd (format "M-%d" n)))
  )
(global-unset-key (kbd "C-z"))
(global-unset-key (kbd "C-c"))
(global-unset-key (kbd "C-x C-z"))

(global-auto-revert-mode t)
(add-hook 'c-mode-common-hook
  (lambda()
    (local-set-key (kbd "C-2") 'hs-show-block)
    (local-set-key (kbd "C-1")  'hs-hide-block)
    (local-set-key (kbd "C-4")    'hs-hide-all)
    (local-set-key (kbd "C-3")  'hs-show-all)
	(local-set-key [(shift mouse-2)] 'hs-mouse-toggle-hiding)
    (hs-minor-mode t)))

#+END_SRC

* Debugging
#+BEGIN_SRC emacs-lisp
(setq
 ;; use gdb-many-windows by default
 gdb-many-windows t

 ;; Non-nil means display source file containing the main routine at startup
 gdb-show-main t
 )
#+END_SRC

* Aggressive-indent
#+BEGIN_SRC emacs-lisp
;; Keeps code correctly indented during editing.
(use-package aggressive-indent
  :ensure t
  :config
  (global-aggressive-indent-mode t)
  (add-to-list 'aggressive-indent-excluded-modes 'latex-mode)
  (add-to-list 'aggressive-indent-excluded-modes 'org-edit-src-code)
  (add-to-list 'aggressive-indent-excluded-modes 'haskell-mode)
  (add-to-list
  'aggressive-indent-dont-indent-if
  '(and (derived-mode-p 'c-mode)
       (null (string-match "\\([;{}]\\|\\b\\(if\\|for\\|while\\)\\b\\)"
                           (thing-at-point 'line))))))
  
#+END_SRC
* CCMode custom
#+BEGIN_SRC emacs-lisp

#+END_SRC
;;CC spacing
(require 'cc-mode)
(setq-default c-basic-offset 4 c-default-style "linux")
;;(setq-default tab-width 4 indent-tabs-mode t)
(setq-default tab-width 4)

(define-key c-mode-base-map (kbd "RET") 'newline-and-indent)
* Smartparens (need to learn)
#+BEGIN_SRC emacs-lisp
(use-package smartparens
:ensure t
:config
(use-package smartparens-config)
(use-package smartparens-html)
(use-package smartparens-python)
(use-package smartparens-latex)
(smartparens-global-mode t)
(show-smartparens-global-mode t)
:bind
( ("C-<down>" . sp-down-sexp)
 ("C-<up>"   . sp-up-sexp)
 ("M-<down>" . sp-backward-down-sexp)
 ("M-<up>"   . sp-backward-up-sexp)
("C-M-a" . sp-beginning-of-sexp)
 ("C-M-e" . sp-end-of-sexp)



 ("C-M-f" . sp-forward-sexp)
 ("C-M-b" . sp-backward-sexp)

 ("C-M-n" . sp-next-sexp)
 ("C-M-p" . sp-previous-sexp)

 ("C-S-f" . sp-forward-symbol)
 ("C-S-b" . sp-backward-symbol)

 ("C-<right>" . sp-forward-slurp-sexp)
 ("M-<right>" . sp-forward-barf-sexp)
 ("C-<left>"  . sp-backward-slurp-sexp)
 ("M-<left>"  . sp-backward-barf-sexp)

 ("C-M-t" . sp-transpose-sexp)
 ("C-M-k" . sp-kill-sexp)
 ("C-k"   . sp-kill-hybrid-sexp)
 ("M-k"   . sp-backward-kill-sexp)
 ("C-M-w" . sp-copy-sexp)

 ("C-M-d" . delete-sexp)

 ("M-<backspace>" . backward-kill-word)
 ("C-<backspace>" . sp-backward-kill-word)
 ([remap sp-backward-kill-word] . backward-kill-word)

 ("M-[" . sp-backward-unwrap-sexp)
 ("M-]" . sp-unwrap-sexp)

 ("C-x C-t" . sp-transpose-hybrid-sexp)

 ("C-c ("  . wrap-with-parens)
 ("C-c ["  . wrap-with-brackets)
 ("C-c {"  . wrap-with-braces)
 ("C-c '"  . wrap-with-single-quotes)
 ("C-c \"" . wrap-with-double-quotes)
 ("C-c _"  . wrap-with-underscores)
("C-c `"  . wrap-with-back-quotes)
))

;;--------------------------------------------
#+END_SRC

* ggtags
sudo apt-get install global
#+BEGIN_SRC emacs-lisp
;;ggtags source code navigation
(use-package ggtags
	:ensure t
	:config 
	(add-hook 'c-mode-common-hook
          (lambda ()
            (when (derived-mode-p 'c-mode 'c++-mode 'java-mode)
              (ggtags-mode 1))))
)
#+END_SRC
* windows size
#+BEGIN_SRC emacs-lisp
(defun set-frame-size-according-to-resolution ()
  (interactive)
  (if window-system
  (progn
    ;; use 120 char wide window for largeish displays
    ;; and smaller 80 column windows for smaller displays
    ;; pick whatever numbers make sense for you
    (if (> (x-display-pixel-width) 1280)
           (add-to-list 'default-frame-alist (cons 'width 120))
           (add-to-list 'default-frame-alist (cons 'width 80)))
    ;; for the height, subtract a couple hundred pixels
    ;; from the screen height (for panels, menubars and
    ;; whatnot), then divide by the height of a char to
    ;; get the height we want
    (add-to-list 'default-frame-alist 
         (cons 'height (/ (- (x-display-pixel-height) 200)
                             (frame-char-height)))))))

(set-frame-size-according-to-resolution)
#+END_SRC

* new
#+BEGIN_SRC emacs-lisp

#+END_SRC
